app/View/Components/Listing.php

    public function render()
    {
        $products = Product::orderBy($this->sort, $this->value)->paginate($this->count, $columns = ['*'], $pageName = 'page', $page = $this->page);
---
select * from `products` order by `sort` asc limit 20 offset 0
select count(*) as aggregate from `products`