app/View/Components/Search.php

select * from `products` where `title` LIKE '%Наименование товара 26 - Новый Добавлен%' order by `sort` asc limit 20 offset 0
select count(*) as aggregate from `products` where `title` LIKE '%Наименование товара 26 - Новый Добавлен%'
---
    public function render()
    {
        $products = Product::where('title', 'LIKE', "%$this->s%")->orderBy($this->sort, $this->value)->paginate($this->count, $columns = ['*'], $pageName = 'page', $page = $this->page);