app/Imports/ProductsImagesUpdate.php

select * from `products` where `id` = 'A-26' limit 1
update `products` set `image` = 'product/image-311.jpg', `products`.`updated_at` = '2021-07-08 11:10:34' where `id` = 'A-26'
delete from `images` where `product_id` = 'A-26'
---
    public function collection(Collection $rows)
    {
        foreach ($rows as $row)
        {
            //Получаем товар
            $product = Product::where('id', $row['id_product'])->first();

            $imageOne = $product->image;
            $imagesAll = $product->images;

            if(is_file(str_replace('\\', '/', public_path("uploads/$imageOne")))) {
                unlink(str_replace('\\', '/', public_path("uploads/$imageOne")));
            }

            foreach ($imagesAll as $v) {
                if(is_file(str_replace('\\', '/', public_path("uploads/$v->image")))) {
                    unlink(str_replace('\\', '/', public_path("uploads/$v->image")));
                }
            }

            //Получаем изображение
            $images = explode(';', $row['images']);

            if (!empty($row['images'])) {
                $product->update([
                    'image' => $images[0],
                ]);
            }

            if (!empty($row['images'])) {
                Image::where('product_id', $product->id)->delete();