app/Http/Controllers/HomeController.php

    public function index()
    {
        $products = Product::paginate(9);
        $categories = Category::all()->sortBy('sort');
---
select * from `categories`