app/Http/Controllers/ProductController.php

select * from `products` where `slug` = 'naimenovanie-tovara-1-2'
---
    public function index(Request $request ,$slug)
    {
        $products = Product::where('slug', $slug)->get();