app/Providers/AppServiceProvider.php

    public function boot()
    {
        view()->composer('layouts.layout', function ($view) {
            $favicon = Information::where('title', 'Favicon')->first();
            $view->with('favicon', $favicon);
        });

        view()->composer('admin.layouts.layout', function ($view) {
            $favicon = Information::where('title', 'Favicon')->first();
            $view->with('favicon', $favicon);
        });

        view()->composer('layouts.layout', function ($view) {
            $listing = DB::table('main_product');
            $list = $listing->orderBy('id')->pluck('new_product_id')->toArray();
            $products = collect();
            foreach ($list as $v) {
                $products->push(Product::where('id', $v)->first());
            }

            $view->with('products', $products);
        });

        view()->composer('layouts.layout', function ($view) {
            $logotip = Information::where('title', 'Логотип')->get();
---
select * from `information` where `title` = 'Favicon' limit 1
select `new_product_id` from `main_product` order by `id` asc
select * from `products` where `id` = 'A-4' limit 1
select * from `information` where `title` = 'Логотип'

        });

        view()->composer('layouts.layout', function ($view) {
            $layout = Information::where('title', 'Подвал')->get();
---
select * from `information` where `title` = 'Подвал'


        view()->composer('layouts.best', function ($view) {
            $listing = DB::table('main_product');
            $list = $listing->orderBy('id')->pluck('best_product_id')->toArray();
            $products = collect();
            foreach ($list as $v) {
                $products->push(Product::where('id', $v)->first());
---
select `best_product_id` from `main_product` order by `id` asc
select * from `products` where `id` = 'A-3' limit 1