app/Http/Controllers/Admin/ProductController.php

select * from `products` where `title` LIKE '%Наименование товара 26 - Новый Добавлен%' limit 25 offset 0
select count(*) as aggregate from `products` where `title` LIKE '%Наименование товара 26 - Новый Добавлен%'
---
    public function search(Request $request)
    {
        $products = Product::where('title', 'LIKE', "%$request->s%")->paginate(25);

select * from `products` where `id` LIKE '%A-6%' limit 25 offset 0
select count(*) as aggregate from `products` where `id` LIKE '%A-6%'
---
    public function searchId(Request $request)
    {
        $products = Product::where('id', 'LIKE', "%$request->id%")->paginate(25);